##
# Este es mi Brewfile con todo mis herramientas necesarias pa' ser productivo y
# que mes gusta
##

# Customization for my prompt {
brew "starship"
# }

# Core git related things that make Git better for me {
brew "git"
brew "gh"
brew "pre-commit"
brew "diffr"
brew "direnv"
#
# Command-line unarchiving tools supporting multiple formats
# https://theunarchiver.com/command-line
brew "unar"

brew "zstd"
tap "sparkbox/commit-colors"
brew "commit-colors"
# }

brew "act"


brew "curl"
brew "openssl@3"
cask "opensc"
brew "libp11"
brew "p11-kit"


# This gives me a more Linux-y feel than the standard tools on Darwin. {
brew "gawk"
brew "coreutils"
# }

brew "jq"

# Pipe viewer: http://ivarch.com/programs/pv
brew "pv"

# These are all the neat Rust tools I use that I can install via Homebrew {
tap "clementtsang/bottom"
brew "bottom"
brew "bandwhich"
brew "bat"
brew "dust"
brew "exa"
brew "fd"
brew "grex"
brew "procs"
brew "ripgrep"
brew "sd"
brew "tealdeer"
brew "zoxide"
# }

brew "ranger"
brew "catimg"
brew "httpie"
brew "tree"

brew "shellcheck"
brew "shfmt"

brew "keychain"

brew "lynx"
brew "spotify-tui"

# The ZSH plugins I use for my terminal
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# I need this for my productivity in the terminal {
brew "tmux"
brew "tree-sitter"
brew "luajit", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "spark"
brew "htop"
brew "entr"
brew "ctags"
# I need this to be able to have a unified clipboard in Tmux, Vim, and iTerm2
brew "reattach-to-user-namespace"
# }

# I need this for my emotional productivity in the terminal {
brew "imagemagick"
brew "ffmpeg"
brew "aom"
brew "imath"
brew "aribb24"
brew "opus"
brew "speex"
brew "srt"

# Encoding detector library
# https://www.freedesktop.org/wiki/Software/uchardet/
brew "uchardet"

# }

# The GPG package I use to use GPG with my signed commits.
brew "gpg2"

brew "nvm"
brew "python"
brew "erlang"
brew "elixir"
brew "go"
brew "rustup"
brew "tidy-html5"

# The applications I use {
cask "1password-cli"
cask "adobe-creative-cloud"
cask "anki"
cask "audacity"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "handbrake"
cask "hot"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "launchbar"
cask "lagrange"
cask "notational-velocity"
cask "postman"
cask "rar"
cask "slack"
cask "soulver"
cask "spotify"
cask "time-out"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "wireshark"
cask "writer"
cask "zoom"
cask "keycastr"
cask "sf-symbols"
# }


brew "asdf"
brew "autoconf"
brew "automake"
brew "aws-vault"
brew "awscli"
brew "bandwhich"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "boost"
brew "bottom"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certigo"
brew "chamber"
brew "chezmoi"
brew "choose-rust"
brew "circleci"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "cook"
brew "cook-docs"
brew "coreutils"
brew "ctags"
brew "dart"
brew "dav1d"
brew "dbus"
brew "diffr"
brew "direnv"
brew "docbook"
brew "docbook-xsl"
brew "docutils"
brew "double-conversion"
brew "dust"
brew "edencommon"
brew "elixir"
brew "entr"
brew "erlang"
brew "exa"
brew "exercism"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fizz"
brew "flac"
brew "fmt"
brew "folly"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gawk"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gflags"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "gifsicle"
brew "git"
brew "glew"
brew "glib"
brew "glog"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "gource"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "grex"
brew "groff"
brew "gts"
brew "guile"
brew "harfbuzz"
brew "highway"
brew "htmltest"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "icu4c"
brew "imagemagick"
brew "irssi"
brew "jansson"
brew "jasper"
brew "jbig2dec"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "keychain"
brew "lame"
brew "ledger"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libnghttp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libpthread-stubs"
brew "libraw"
brew "librist"
brew "librsvg"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "little-cms2"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "lynx"
brew "lz4"
brew "lzo"
brew "m4"
brew "mbedtls"
brew "mpdecimal"
brew "mpfr"
brew "mpg123"
brew "msgpack"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "nghttp2"
brew "node-build"
brew "nodenv"
brew "npth"
brew "nvm"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "pango"
brew "pcre"
brew "pcre2"
brew "pfetch"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "plantuml"
brew "portaudio"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "psutils"
brew "pv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "pyyaml"
brew "rav1e"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "rustup-init"
brew "sass"
brew "scdoc"
brew "screenresolution"
brew "sd"
brew "sdl2"
brew "sdl2_image"
brew "shared-mime-info"
brew "six"
brew "sketchybar"
brew "skhd"
brew "snappy"
brew "sqlite"
brew "statix"
brew "structurizr-cli"
brew "svt-av1"
brew "terraform-docs"
brew "terraform-ls"
brew "tesseract"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "theora"
brew "tokei"
brew "unbound"

# Very basic terminfo library
# https://github.com/neovim/unibilium
brew "unibilium"

brew "universal-ctags"

# ODBC 3 connectivity for UNIX
# http://www.unixodbc.org/
brew "unixodbc"

brew "utf8proc"
brew "virtualenv"
brew "viu"
brew "wangle"
brew "watch"
brew "watchman"
brew "webp"
brew "wxmac"
brew "wxwidgets"
brew "x264"
brew "x265"
brew "xmlto"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yabai"
brew "yq"
brew "zeromq"
brew "zimg"
brew "zlib"
brew "zstd"
